export const krToJpnArtistSort = {
  // A-Z
  Aimer: 'Aimer',
  DECO27: 'DECO*27',

  // 가
  '결속 밴드': '結束バンド',

  // 나
  나토리: 'なとり',
  녹황색사회: '緑黄色社会',

  // 라
  래드윔프스: 'RADWIMPS',
  리사: 'LISA',

  // 마
  '미세스 그린 애플': 'Mrs. GREEN APPLE',

  // 바
  바운디: 'Vaundy',
  '범프 오브 치킨': 'Bump of Chicken',

  // 사
  '세카이노 오와리': 'SEKAI NO OWARI',
  스키마스위치: 'スキマスイッチ',
  스파이에어: 'SPYAIR',

  // 아
  아라시: '嵐',
  아마자라시: 'amazarashi',
  아이묭: 'あいみょん',
  엘레가든: 'ELLEGARDEN',
  '오이시 마사요시': 'オーイシマサヨシ',
  오피셜히게단디즘: 'Official髭男dism',
  '요네즈 켄시': '米津玄師',
  요루시카: 'ヨルシカ',
  요아소비: 'YOASOBI',
  유우리: '優里',
  유이카: '『ユイカ』',
  이키모노가카리: 'いきものがかり',

  // 자
  '즛토마요(계속 한밤중이면 좋을텐데.)': 'ずっと真夜中でいいのに。',

  // 카
  '크리피 너츠': 'Creepy Nuts',
  '킹 누': 'King Gnu',

  // 하
  '하츠네 미쿠': '初音ミク',
  '호시노 겐': '星野源',
  '후지이 카제': '藤井風',
};

export const krToJpnArtist = {
  // 임의 그룹 시작

  아라시: '嵐',
  아이묭: 'あいみょん',
  '요네즈 켄시': '米津玄師',
  오피셜히게단디즘: 'Official髭男dism',
  요루시카: 'ヨルシカ',

  // 나무위키 추가 시작
  Aimer: 'Aimer',
  아마자라시: 'amazarashi',
  '범프 오브 치킨': 'Bump of Chicken',
  엘레가든: 'ELLEGARDEN',
  '킹 누': 'King Gnu',
  리사: 'LISA',
  '미세스 그린 애플': 'Mrs. GREEN APPLE',
  래드윔프스: 'RADWIMPS',
  '세카이노 오와리': 'SEKAI NO OWARI',
  스파이에어: 'SPYAIR',
  바운디: 'Vaundy',
  요아소비: 'YOASOBI',
  '크리피 너츠': 'Creepy Nuts',

  // 나무위키 추가 끝
  '즛토마요(계속 한밤중이면 좋을텐데.)': 'ずっと真夜中でいいのに。',
  녹황색사회: '緑黄色社会',
  '결속 밴드': '結束バンド',
  '하츠네 미쿠': '初音ミク',
  DECO27: 'DECO*27(Feat.初音ミク)',
  유우리: '優里',
  유이카: '『ユイカ』',
  스키마스위치: 'スキマスイッチ',
  이키모노가카리: 'いきものがかり',
  '호시노 겐': '星野源',
  '후지이 카제': '藤井風',
  '오이시 마사요시': 'オーイシマサヨシ',
  나토리: 'なとり',

  // 임의 그룹 끝
  동방신기: '東方神起',
  '하마사키 아유미': '浜崎あゆみ',
  '미즈키 나나': '水樹奈々',
  '모닝구 무스메': 'モーニング娘。',
  '나카시마 미카': '中島美嘉',
  '우타다 히카루': '宇多田ヒカル',
  '니시노 카나': '西野カナ',
  '칸쟈니 에이트': '関ジャニ∞',
  '아무로 나미에': '安室奈美恵',
  '쿠라키 마이': '倉木麻衣',
  '코다 쿠미': '倖田來未',
  '사카모토 마아야': '坂本真綾',
  노기자카46: '乃木坂46',
  방탄소년단: '防弾少年団',
  롱피아오피아오: '龙飘飘',
  소녀시대: '少女時代',
  '하야시바라 메구미': '林原めぐみ',
  저우선: '周深',
  포르노그라피티: 'ポルノグラフィティ',
  '마츠우라 아야': '松浦亜弥',
  쉐즈첸: '薛之谦',
  '미즈모리 카오리': '水森かおり',
  윤하: 'ユンナ',
  '호리에 유이': '堀江由衣',
  코부쿠로: 'コブクロ',
  '캬리 파뮤파뮤': 'きゃりーぱみゅぱみゅ',
  '모모이로 클로버 Z': 'ももいろクローバーZ',
  '타키 앤 츠바사': 'タッキー＆翼',
  '키타니 타츠야': 'キタニタツヤ',
  '베리즈 코보': 'Berryz工房',
  리롱하오: '李荣浩',
  '스즈키 코노미': '鈴木このみ',
  '스다 마사키': '菅田将暉',
  '후쿠야마 마사하루': '福山雅治',
  '오오츠카 아이': '大塚愛',
  '요네쿠라 치히로': '米倉千尋',
  'G.E.M.덩쯔치': 'G.E.M.邓紫棋',
  '히라이 켄': '平井 堅',
  '타무라 유카리': '田村ゆかり',
  '토바 이치로': '鳥羽一郎',
  챤미나: 'ちゃんみな',
};
